In [169]:
# load setup.py file
%run setup.py

df_invited = pd.read_csv('factInvited.csv')
df_proceedings = pd.read_csv('factProceedings.csv')
df_proceedings_copy = pd.read_csv('factProceedings.csv')

In [170]:
df_proceedings['Middel name'] = df_proceedings['Last name'].str.split(' ').str[0].str.lower()
df_proceedings['Family name'] = df_proceedings['Last name'].str.split(' ').str[1:].str.join(' ').str.lower()
df_proceedings.head()

,Full name,Year,Field,File name,First name,Last name,gender,Middel name,Family name
0,Atsushi Takahara,1997,Computer Architecture,ASPDAC,atsushi,takahara,M,takahara,
1,Yutaka Tamiya,1997,Computer Architecture,ASPDAC,yutaka,tamiya,M,tamiya,
2,Atsushi Takahashi,1997,Computer Architecture,ASPDAC,atsushi,takahashi,M,takahashi,
3,Yoji Kajitani,1997,Computer Architecture,ASPDAC,yoji,kajitani,M,kajitani,
4,Dirk Behrens,1997,Computer Architecture,ASPDAC,dirk,behrens,M,behrens,

In [171]:
# keep only non-nan values in Middel name
df_proceedings = df_proceedings[df_proceedings['Family name'] != ""]
# drop columns
df_proceedings = df_proceedings.drop(['Year', 'Field', 'File name','Last name','gender'], axis=1)

In [172]:
df1 = df_proceedings[df_proceedings.duplicated(['First name', 'Family name'], keep=False)]
# drop all rows with duplicate Full names and keep the first occurence
df2 = df_proceedings.drop_duplicates(['Full name'], keep='first')

In [173]:
df3 = df2[df2.duplicated(['First name', 'Family name'], keep=False)].sort_values(by=['First name']) # reset index

In [174]:
# keep all rows from df_proceedings_copy that has index from df3
df4 = df_proceedings_copy[df_proceedings_copy.index.isin(df3.index)]

In [175]:
df4.shape

(701, 7)

In [81]:
df = pd.read_csv('test.csv')

# Check if duplicated of First name and Last name exist
df1 = df[df.duplicated(['First name', 'Last name'], keep=False)]
# if the Middel name 

df1.head()

              Full Name First name Middel name Last name
0      Henrik A. Jensen     Henrik          A.    Jensen
1      Henrik A. Jensen     Henrik          A.    Jensen
2  Henrik Anders Jensen     Henrik      Anders    Jensen
3   Henrik Peter Jensen     Henrik       Peter    Jensen

In [61]:
df2.head()

                Full Name First name Middel name Last name
0        Henrik A. Jensen     Henrik          A.    Jensen
1    Henrik Anders Jensen     Henrik      Anders    Jensen
2     Henrik Peter Jensen     Henrik       Peter    Jensen
3  Henrik Anders Andersen     Henrik      Anders  Andersen